/**
 * @filename StandardConstraint.sql
 * @description Sql - 数据约束
 * 约束分析
 * 约束创建
 * 约束删除
 * 约束修改
 * 约束查看
 * @author qye.zheng
 * @version 1.0
 */

/* ====================  ==================== */

/* 约束分析 */

/*
约束用于限制加入表的数据类型.

*/

/*
约束类型

NOT NULL
UNIQUE
PRIMARY KEY
FOREIGN KEY
CHECK
DEFAULT

*/

/*
每张表只能有一个 PRIMARY KEY 约束，其他约束可以有多个.
每张表都应该有一个主键，并且只能有一个主键.
注意，一个/多个列可以参与约束；例如主键可以由1个或多个列参与
构成；也即列和约束不是一对一关系，而是多对多关系.

*/

/* ====================  ==================== */

/* 约束创建 */
CREATE CONSTRAINT constraint_name constraint_def;

/* 针对表创建约束 */
ALTER TABLE tb_name ADD CONSTRAINT constraint_name constraint_def;
/* ====================  ==================== */

/* 约束删除 */
DROP CONSTRAINT constraint_name;

/* 删除针对表的约束 */
ALTER TABLE tb_name DROP CONSTRAINT constraint_name;

/* ====================  ==================== */

/* 约束修改 */
ALTER CONSTRAINT constraint_name;

/* ====================  ==================== */

/* 约束查看 */

/* ====================  ==================== */

/*  */

/* ====================  ==================== */

/*  */

/* ====================  ==================== */

/*  */





/* ====================  ==================== */
/*  */

/* ====================  ==================== */
/*  */

/* ====================  ==================== */

/*  */

/* ====================  ==================== */
/*  */











